c5/src/InformationRegisters/DeactivationReasons/DeactivationReasons.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DeactivationReasons</name>
  <resources>
    <name>DeactivationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Difficult</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Expensive</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>NoReason</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Slow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Unusable</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Useless</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Documents/TenantPayment/TenantPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantPayment</name>
  <registerRecords>AccumulationRegister.Agents</registerRecords>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>TenantOrder</name>
    <type>
      <types>DocumentRef.TenantOrder</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Documents/TenantOrder/TenantOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantOrder</name>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>AccessPrice</name>
    <type>
      <types>DefinedType.Price</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BonusPercent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>MonthsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PromoCodeDiscount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>UsersCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Catalogs/Tenants/Tenants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Tenants</name>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Deactivated</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EndOfTrialPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PromoCode</name>
    <type>
      <types>CatalogRef.PromoCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/PaymentNotifications/Module.bsl
Procedure Send () export
	
	SetPrivilegedMode ( true );
	profile = MailboxesSrv.SystemProfile ();
	message = new InternetMailMessage ();
	table = getTenants ();
	payers = getPayers ();
	for each row in table do
		if ( payers [ row.Tenant ] = undefined ) then
			continue;
		endif; 
		setSenderAndReceiver ( row, message );
		setSubjectAndBody ( row, message );
		try
			MailboxesSrv.Post ( profile, message );
		except
			WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, Metadata.ScheduledJobs.PaymentNotifications, , ErrorDescription () );
		endtry
	enddo; 
	SetPrivilegedMode ( false );
	
EndProcedure

Function getTenants ()
	
	s = "
	|select Tenants.Ref as Tenant, Tenants.Code as Code, Tenants.Description as Email, true as TrialPeriod, null as UsersCount, null as OrderNumber
	|from Catalog.Tenants as Tenants
	|	//
	|	// TenantPayments
	|	//
	|	left join Document.TenantPayment as TenantPayments
	|	on TenantPayments.TenantOrder.Tenant = Tenants.Ref
	|	and TenantPayments.Posted
	|where dateadd ( Tenants.EndOfTrialPeriod, day, -" + remindBefore () + " ) = &Today
	|and not Tenants.Deactivated
	|and not Tenants.DeletionMark
	|and TenantPayments.TenantOrder is null
	|union all
	|select TenantOrders.Tenant, TenantOrders.Tenant.Code, TenantOrders.Tenant.Description, false, TenantOrders.UsersCount, TenantOrders.Number
	|from Document.TenantOrder as TenantOrders
	|	//
	|	// TenantPayments
	|	//
	|	left join Document.TenantPayment as TenantPayments
	|	on TenantPayments.TenantOrder = TenantOrders.Ref
	|	and TenantPayments.Posted
	|where dateadd ( TenantOrders.DateEnd, day, -" + remindBefore () + " ) = &Today
	|";
	q = new Query ( s );
	q.SetParameter ( "Today", BegOfDay ( CurrentSessionDate () ) );
	return q.Execute ().Unload ();
	
EndFunction 

Function remindBefore ()
	
	return 5;
	
EndFunction 

Function getPayers ()
	
	result = new Map ();
	q = payersQuery ();
	tenants = Catalogs.Tenants.Select ();
	while ( tenants.Next () ) do
		tenant = tenants.Ref;
		toggleTenant ( tenant );
		if ( q.Execute ().IsEmpty () ) then
			continue;
		endif; 
		result [ tenant ] = true;
	enddo; 
	toggleTenant ( Catalogs.Tenants.EmptyRef () );
	return result;

EndFunction 

Function payersQuery ()
	
	return new Query ( "
	|select 1
	|from Catalog.Users as Users
	|where not Users.IsFolder
	|and not Users.DeletionMark
	|and not Users.AccessDenied
	|and not Users.AccessRevoked
	|having count ( Users.Ref ) > 1
	|" );
	
EndFunction 

Procedure toggleTenant ( Tenant )
	
	SessionParameters.Tenant = Tenant;
	SessionParameters.TenantUse = Tenant <> undefined;
	
EndProcedure 

Procedure setSenderAndReceiver ( Row, Message )
	
	Message.From = Cloud.Info ();
	Message.To.Add ( Row.Email );
	
EndProcedure

Procedure setSubjectAndBody ( Row, Message )
	
	p = new Structure ();
	p.Insert ( "CountOfDays", remindBefore () );
	p.Insert ( "Info", Cloud.Info () );
	p.Insert ( "Website", Cloud.Website () );
	if ( Row.TrialPeriod ) then
		p.Insert ( "TenantOrder", Cloud.GetTenantURL ( Row.Code ) + "/#e1cib/data/Document.TenantOrder" );
		p.Insert ( "DeactivateProfile", Cloud.GetTenantURL ( Row.Code ) + "/#e1cib/command/InformationRegister.DeactivationReasons.Command.Deactivate" );
		Message.Subject = Output.EndOfTrialPeriodSubject ( p );
		Message.Texts.Add ( Output.EndOfTrialPeriodBody ( p ) );
	else
		p.Insert ( "TenantOrder", Cloud.GetTenantURL ( Row.Code ) + "?C=" + EncodeString ( "c1=" + Row.OrderNumber, StringEncodingMethod.URLInURLEncoding ) );
		p.Insert ( "TenantOrderList", Cloud.GetTenantURL ( Row.Code ) + "/#e1cib/list/Document.TenantOrder" );
		p.Insert ( "UsersCount", Row.UsersCount );
		p.Insert ( "OrderNumber", Row.OrderNumber );
		Message.Subject = Output.EndOfLicensePeriodSubject ( p );
		Message.Texts.Add ( Output.EndOfLicensePeriodBody ( p ) );
	endif; 
	
EndProcedure
